app/views/wikis/new.html.erb

SELECT "users".* FROM "users"
---
          <% collaboration_users = @wiki.collaboration_users %>
          <% User.all.each do |user| %>