app/controllers/charges_controller.rb

  def create
   # Creates a Stripe Customer object, for associating
   # with the charge
   customer = Stripe::Customer.create(
     email: current_user.email,
     card: params[:stripeToken]
   )

   # Where the real magic happens
   charge = Stripe::Charge.create(
     customer: customer.id,
     amount: 15_00,
     description: "Upgrade to a Premium Membership- #{current_user.email}",
     currency: 'usd'
   )

   current_user.update_attribute(:role, 'premium')
---
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 2], ["updated_at", "2017-02-07 10:32:59.021545"], ["id", 54]]