app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 55]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-02-07 12:24:37.928525"], ["id", 55]]
---
   def update
     @user = User.find(params[:id])
     @user.role = 'standard'

     if @user.save