app/controllers/wikis_controller.rb

  def index

    if current_user.premium? || current_user.admin?
      @wikis = Wiki.all
    else
      @wikis = Wiki.where(private: false)
---
SELECT "wikis".* FROM "wikis"
SELECT "wikis".* FROM "wikis" WHERE "wikis"."private" = ?  [["private", "f"]]

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 102]]

  def create
    @wiki = Wiki.new
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]

    if current_user.standard?
        @wiki.update_attribute(:private, false)
      end

      @wiki.user = current_user
    authorize @wiki

    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "private", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "**Wow** what a wonderful *World*!"], ["body", "hello **World**!"], ["private", "f"], ["created_at", "2017-02-11 03:13:32.540858"], ["updated_at", "2017-02-11 03:13:32.540858"]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 104]]

  def update
    @wiki = Wiki.find(params[:id])
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]

    authorize @wiki
    if @wiki.update_attributes(wiki_params)
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 104]]
UPDATE "wikis" SET "title" = ?, "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "CAN YOU SEE THIS???"], ["private", "t"], ["updated_at", "2017-02-08 08:42:17.085856"], ["id", 2]]

  def destroy
    @wiki = Wiki.find(params[:id])
    authorize @wiki

    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT 1  [["id", 103]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 103]]